zephyrproject-rtos/zephyr/drivers/ethernet/eth_stm32_hal.c
	heth = &dev_data->heth;

	generate_mac(dev_data->mac_addr);

	heth->Init.MACAddr = dev_data->mac_addr;

#if !defined(CONFIG_ETH_STM32_HAL_API_V2)
	HAL_StatusTypeDef hal_ret = HAL_OK;

	hal_ret = HAL_ETH_Init(heth);
	if (hal_ret == HAL_TIMEOUT) {
		/* HAL Init time out. This could be linked to */
		/* a recoverable error. Log the issue and continue */
		/* driver initialisation */
		LOG_ERR("HAL_ETH_Init Timed out");
	} else if (hal_ret != HAL_OK) {
		LOG_ERR("HAL_ETH_Init failed: %d", hal_ret);
		return -EINVAL;
	}

	dev_data->link_up = false;

	/* Initialize semaphores */
	k_mutex_init(&dev_data->tx_mutex);
	k_sem_init(&dev_data->rx_int_sem, 0, K_SEM_MAX_LIMIT);

	HAL_ETH_DMATxDescListInit(heth, dma_tx_desc_tab,
		&dma_tx_buffer[0][0], ETH_TXBUFNB);
	HAL_ETH_DMARxDescListInit(heth, dma_rx_desc_tab,
		&dma_rx_buffer[0][0], ETH_RXBUFNB);

	hal_ret = HAL_ETH_Start(heth);
	if (hal_ret != HAL_OK) {
		LOG_ERR("HAL_ETH_Start{_IT} failed");
	}
#endif /* !CONFIG_ETH_STM32_HAL_API_V2 */

	setup_mac_filter(heth);


	LOG_DBG("MAC %02x:%02x:%02x:%02x:%02x:%02x",
		dev_data->mac_addr[0], dev_data->mac_addr[1],
		dev_data->mac_addr[2], dev_data->mac_addr[3],
		dev_data->mac_addr[4], dev_data->mac_addr[5]);

	return 0;
}

#if defined(CONFIG_ETH_STM32_MULTICAST_FILTER)
static void eth_stm32_mcast_filter(const struct device *dev, const struct ethernet_filter *filter)
{
	struct eth_stm32_hal_dev_data *dev_data = (struct eth_stm32_hal_dev_data *)dev->data;
	ETH_HandleTypeDef *heth;
	uint32_t crc;
	uint32_t hash_table[2];
	uint32_t hash_index;

	heth = &dev_data->heth;

	crc = __RBIT(crc32_ieee(filter->mac_address.addr, sizeof(struct net_eth_addr)));
	hash_index = (crc >> 26) & 0x3f;

	__ASSERT_NO_MSG(hash_index < ARRAY_SIZE(dev_data->hash_index_cnt));

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet)
	hash_table[0] = heth->Instance->MACHT0R;
	hash_table[1] = heth->Instance->MACHT1R;
#else
	hash_table[0] = heth->Instance->MACHTLR;
	hash_table[1] = heth->Instance->MACHTHR;
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet) */

	if (filter->set) {
		dev_data->hash_index_cnt[hash_index]++;
		hash_table[hash_index / 32] |= (1 << (hash_index % 32));
	} else {
		if (dev_data->hash_index_cnt[hash_index] == 0) {
			__ASSERT_NO_MSG(false);
			return;
		}

		dev_data->hash_index_cnt[hash_index]--;
		if (dev_data->hash_index_cnt[hash_index] == 0) {
			hash_table[hash_index / 32] &= ~(1 << (hash_index % 32));
		}
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet)
	heth->Instance->MACHT0R = hash_table[0];
	heth->Instance->MACHT1R = hash_table[1];
#else
	heth->Instance->MACHTLR = hash_table[0];
	heth->Instance->MACHTHR = hash_table[1];
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet) */
}

#endif /* CONFIG_ETH_STM32_MULTICAST_FILTER */

#if defined(CONFIG_ETH_STM32_HAL_API_V2)
#if defined(CONFIG_ETH_STM32_AUTO_NEGOTIATION_ENABLE)
static uint32_t eth_phy_get_link_state(ETH_HandleTypeDef *heth)
{
	uint32_t readval = 0;
	uint32_t tickstart = 0U;

	tickstart = k_uptime_get_32();

	/* Wait for linked status */
	do {
		HAL_ETH_ReadPHYRegister(heth, PHY_ADDR, PHY_BSR, &readval);

		/* Check for the Timeout */
		if ((k_uptime_get_32() - tickstart) > PHY_TIMEOUT) {
			return HAL_TIMEOUT;
		}
	} while (((readval & PHY_LINKED_STATUS) != PHY_LINKED_STATUS));

	if ((readval & PHY_LINKED_STATUS) == 0) {
		LOG_ERR("Link Down");
		return PHY_STATUS_LINK_DOWN;
	}

	/* Check Auto negotiation */
	if (HAL_ETH_ReadPHYRegister(heth, PHY_ADDR, PHY_BCR, &readval) != HAL_OK) {
		LOG_INF("Error reading BCR register\n");
		return HAL_ERROR;
	}

	if ((readval & PHY_AUTONEGO_ENABLE) != PHY_AUTONEGO_ENABLE) {
		/* Enable Auto-Negotiation */
		if ((HAL_ETH_WritePHYRegister(heth, PHY_ADDR, PHY_BCR, PHY_AUTONEGO_ENABLE)) !=
		    HAL_OK) {
			return HAL_ERROR;
		}
	}

	/* Auto Nego enabled */
	LOG_DBG("Auto nego enabled");
	if (HAL_ETH_ReadPHYRegister(heth, PHY_ADDR, PHY_SCSR, &readval) != HAL_OK) {
		return HAL_ERROR;
	}

	/* Check if auto nego not done */
	if ((readval & PHY_SCSR_AUTONEGO_DONE) == 0) {
		return PHY_STATUS_AUTONEGO_NOTDONE;
	}

	if ((readval & PHY_HCDSPEEDMASK) == PHY_100BTX_FD) {
		return PHY_STATUS_100MBITS_FULLDUPLEX;
	} else if ((readval & PHY_HCDSPEEDMASK) == PHY_100BTX_HD) {
		return PHY_STATUS_100MBITS_HALFDUPLEX;
	} else if ((readval & PHY_HCDSPEEDMASK) == PHY_10BT_FD) {
		return PHY_STATUS_10MBITS_FULLDUPLEX;
	} else {
		return PHY_STATUS_10MBITS_HALFDUPLEX;
	}
}

static void get_auto_nego_speed_duplex(ETH_HandleTypeDef *heth, ETH_MACConfigTypeDef *mac_config)
{
	uint32_t phyLinkState;
	uint32_t tickstart = k_uptime_get_32();

	do {
		phyLinkState = eth_phy_get_link_state(heth);
	} while ((phyLinkState <= PHY_STATUS_LINK_DOWN) &&
		 ((k_uptime_get_32() - tickstart) < PHY_TIMEOUT));

	/* Get link state */
	if (phyLinkState <= PHY_STATUS_LINK_DOWN) {
		return;
	}

	switch (phyLinkState) {
	case PHY_STATUS_100MBITS_FULLDUPLEX:
		mac_config->DuplexMode = ETH_FULLDUPLEX_MODE;
		mac_config->Speed = ETH_SPEED_100M;
		break;
	case PHY_STATUS_100MBITS_HALFDUPLEX:
		mac_config->DuplexMode = ETH_HALFDUPLEX_MODE;
		mac_config->Speed = ETH_SPEED_100M;
		break;
	case PHY_STATUS_10MBITS_FULLDUPLEX:
		mac_config->DuplexMode = ETH_FULLDUPLEX_MODE;
		mac_config->Speed = ETH_SPEED_10M;
		break;
	case PHY_STATUS_10MBITS_HALFDUPLEX:
		mac_config->DuplexMode = ETH_HALFDUPLEX_MODE;
		mac_config->Speed = ETH_SPEED_10M;
		break;
	default:
		mac_config->DuplexMode = ETH_FULLDUPLEX_MODE;
		mac_config->Speed = ETH_SPEED_100M;
		break;
	}
}
#endif /* CONFIG_ETH_STM32_AUTO_NEGOTIATION_ENABLE */

static int eth_init_api_v2(const struct device *dev)
{
	HAL_StatusTypeDef hal_ret = HAL_OK;
	struct eth_stm32_hal_dev_data *dev_data;
	ETH_HandleTypeDef *heth;
	ETH_MACConfigTypeDef mac_config;

	dev_data = dev->data;
	heth = &dev_data->heth;

	heth->Init.TxDesc = dma_tx_desc_tab;
	heth->Init.RxDesc = dma_rx_desc_tab;
	heth->Init.RxBuffLen = ETH_STM32_RX_BUF_SIZE;

	hal_ret = HAL_ETH_Init(heth);
	if (hal_ret == HAL_TIMEOUT) {
		/* HAL Init time out. This could be linked to */
		/* a recoverable error. Log the issue and continue */
		/* driver initialisation */
		LOG_ERR("HAL_ETH_Init Timed out");
	} else if (hal_ret != HAL_OK) {
		LOG_ERR("HAL_ETH_Init failed: %d", hal_ret);
		return -EINVAL;
	}

#if defined(CONFIG_PTP_CLOCK_STM32_HAL)
	/* Enable timestamping of RX packets. We enable all packets to be
	 * timestamped to cover both IEEE 1588 and gPTP.
	 */
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet)
	heth->Instance->MACTSCR |= ETH_MACTSCR_TSENALL;
#else
	heth->Instance->PTPTSCR |= ETH_PTPTSCR_TSSARFE;
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_ethernet) */
#endif /* CONFIG_PTP_CLOCK_STM32_HAL */

	dev_data->link_up = false;

